type MessageItem = {
  title: string;
  description: string;
  btnLabel: string;
};

export const Messages: { [key: string]: MessageItem } = {
  noSearchResults: {
    title: "نتیجه‌ای یافت نشد",
    description: "",
    btnLabel: "",
  },

  wishList: {
    title: "شما هنوز آگهی‌ای رو ذخیره نکردید!",
    description: "از طریق آیکون «نشان‌کردن» می‌تونید آگهی‌های مورد نظرتون رو در این لیست ذخیره کنید.",
    btnLabel: "جستجو کنید",
  },

  myAds: {
    title: "شما هنوز آگهی‌ای ثبت نکردید!",
    description: "روزانه هزاران مشتری در رنتی‌فای در جستجوی ملک مورد نظرشان هستند",
    btnLabel: "ثبت آگهی ‌رایگان",
  },

  unknownError: {
    title: "مشکلی پیش آمد",
    description: "سمت سرور مشکلی پیش امده است لطفا دوباره تلاش کنید",
    btnLabel: "تلاش دوباره",
  },

  noHomesFound: {
    title: "خانه ای یافت نشد!",
    description: "نتیجه‌ای مطابق با فیلترهای شما پیدا نشد.",
    btnLabel: "حذف همه فیلتر ها",
  },

  "404": {
    title: "صفحه‌ی مورد نظر یافت نشد!",
    description: "این صفحه در رنتی‌فای یافت نشد. لطفا به صفحه اصلی مراجعه کنید تا املاک مورد نظر خود را پیدا کنید",
    btnLabel: "بازگشت به صفحه اصلی",
  },

  homeCreated: {
    title: "آگهی با موفقیت ثبت شد",
    description: "خانه شما با موفقیت در رنتی‌فای ثبت شد.",
    btnLabel: "مشاهده آگهی‌ها",
  },

  "404_Home": {
    title: "خانه مورد نظر یافت نشد",
    description: "متاسفانه خانه ای که به دنبال آن بودید در دسترس نیست یا حذف شده است.",
    btnLabel: "بازگشت به لیست خانه‌ها",
  },

  "404_Blog": {
    title: "مطلب مورد نظر یافت نشد",
    description: "متاسفانه مطلبی که به دنبال آن بودید موجود نیست یا حذف شده است.",
    btnLabel: "بازگشت به لیست مطالب",
  },

  "404_Agent": {
    title: "نماینده مورد نظر یافت نشد",
    description: "متاسفانه نماینده‌ای که به دنبال آن بودید موجود نیست یا حذف شده است.",
    btnLabel: "بازگشت به لیست نمایندگان",
  },

  noProperties: {
    title: "هیچ ملکی پیدا نشد",
    description: "به نظر می‌رسد این املاک هنوز آگهی ثبت نکرده‌اند. می‌توانید سایر آگهی‌ها و نمایندگان را بررسی کنید.",
    btnLabel: "مشاهده نمایندگان",
  },

  noMessages: {
    title: "پیامی یافت نشد",
    description: "در حال حاضر هیچ پیامی وجود ندارد.",
    btnLabel: "برگشتن به صفحه اصلی",
  },

  noBlogs: {
    title: "مقاله‌ای پیدا نشد",
    description: "در حال حاضر هیچ مقاله‌ای وجود ندارد.",
    btnLabel: "بازگشت به صفحه اصلی",
  },

  noPendingAds: {
    title: "آگهی پیدا نشد",
    description: "در حال حاضر هیچ آگهی در انتظار وجود ندارد.",
    btnLabel: "برگشتن به صفحه اصلی",
  },
};

export const mongooseDuplicateError = {
  name: "وارد کردن نام الزامی است",
  last_name: "وارد کردن نام خانوادگی الزامی است",
  phone_number: "وارد کردن شماره تلفن الزامی است",
  id: "وارد کردن شناسه الزامی است",
  isValidObjectId: "فرمت شناسه معتبر نیست",
  //
  maxImageSize: "حجم فایل نمی‌تواند بیشتر از 100 کیلوبایت باشد.",
  ImageType: "فرمت فایل معتبر نیست. فقط JPEG، PNG، یا WebP مجاز است.",
};
