import { Home2, Profile2User, DocumentText, Add, Sms, Call, Location } from "iconsax-react";
import { FC, SVGProps } from "react";

export const navHeader = [
  {
    path: "/property-search",
    icon: Home2,
    metaData: {
      title: "رهن و اجاره‌ی خانه",
      description: "جدیدترین آگهی‌های رهن و اجاره آپارتمان در تهران با امکان فیلتر بر اساس محله، متراژ، تعداد اتاق و امکانات.",
    },
  },
  {
    path: "/agents",
    icon: Profile2User,
    metaData: {
      title: "مشاورین املاک",
      description: "لیست مشاورین املاک معتبر همراه با اطلاعات تماس و تخصص‌های هر مشاور، برای انتخاب بهترین راهنمای خرید و فروش یا اجاره خانه.",
    },
  },
  {
    path: "/blog",
    icon: DocumentText,
    metaData: {
      title: "بلاگ رنتی فای",
      description: "در بلاگ رنتی فای می‌توانید جدیدترین مقالات، نکات کاربردی و راهنمای جامع در زمینه اجاره خانه، خرید و فروش ملک، نکات حقوقی قراردادها و مدیریت بهتر املاک را مطالعه کنید. ما تلاش می‌کنیم تا با محتوای آموزشی و تخصصی، به شما کمک کنیم تصمیم‌های هوشمندانه‌تری در بازار مسکن بگیرید.",
    },
  },
  {
    path: "/contact-us",
    icon: Call,
    metaData: {
      title: "ارتباط با ما",
      description: "راه‌های تماس با تیم رنتی فای برای پاسخ به سوالات شما، ارائه پشتیبانی و دریافت پیشنهادات و بازخوردها.",
    },
  },
  {
    path: "/dashboard/user/register-ads",
    icon: Add,
    metaData: {
      title: "ثبت آگهی رایگان",
      description: "امکان ثبت آگهی رایگان ملک خود در سایت رنتی فای برای اجاره یا فروش با چند کلیک ساده و مدیریت آسان آگهی‌ها.",
    },
  },
] as const;

export const bagdes = [
  {
    label: "نماد اعتماد الکترونیکی",
    path: "/",
    image: "/images/badges/eNamad.png",
  },
  {
    label: "ستاد ساماندهی پایگاه های اینترنتی",
    path: "/",
    image: "/images/badges/samandehi.png",
  },
  {
    label: "اتحادیه کشوری صنف مشاوران املاک",
    path: "/",
    image: "/images/badges/etehadie.png",
  },
] as const;

type navFooterType = {
  title: string;
  list: { label: string; path: string; icon?: FC<SVGProps<SVGSVGElement>> }[];
};

export const navFooter: navFooterType[] = [
  {
    title: "محصول",
    list: [
      { label: "ویژگی ها", path: "/features" },
      { label: "قیمت گذاری", path: "/pricing" },
      { label: "مطالعات موردی", path: "/case-studies" },
      { label: "بررسی کردن", path: "/reviews" },
      { label: "پشتیبانی محصول", path: "/product-support" },
    ],
  },
  {
    title: "شرکت",
    list: [
      { label: navHeader[3].metaData.title, path: navHeader[3].path },
      { label: navHeader[2].metaData.title, path: navHeader[2].path },
      { label: "فرهنگ", path: "/culture" },
      { label: "درباره", path: "/about" },
      { label: "اخبار و رویدادها", path: "/news" },
    ],
  },
  {
    title: "پشتیبانی",
    list: [
      { label: "شروع کردن", path: "/getting-started" },
      { label: "مرکز کمک", path: "/help-center" },
      { label: "تنظیمات سرور", path: "/server-settings" },
      { label: "گزارش اشکال", path: "/report-bug" },
      { label: "پشتیبانی چت", path: "/chat-support" },
    ],
  },
  {
    title: navHeader[3].metaData.title,
    list: [
      { icon: Sms, label: "rentify@gmail.com", path: "mailto:rentify@gmail.com" },
      { icon: Call, label: "۰۲۱-۴۳۵۳۶۳", path: "tel:+9821435363" },
      { icon: Location, label: "تهران - زعفرانیه - پلاک 13", path: "https://www.google.com/maps" },
    ],
  },
] as const;

export const path_user = [
  {
    icon: (
      <svg xmlns="http://www.w3.org/2000/svg" height="24px" viewBox="0 -960 960 960" width="24px" fill="currentcolor">
        <path d="M234-276q51-39 114-61.5T480-360q69 0 132 22.5T726-276q35-41 54.5-93T800-480q0-133-93.5-226.5T480-800q-133 0-226.5 93.5T160-480q0 59 19.5 111t54.5 93Zm246-164q-59 0-99.5-40.5T340-580q0-59 40.5-99.5T480-720q59 0 99.5 40.5T620-580q0 59-40.5 99.5T480-440Zm0 360q-83 0-156-31.5T197-197q-54-54-85.5-127T80-480q0-83 31.5-156T197-763q54-54 127-85.5T480-880q83 0 156 31.5T763-763q54 54 85.5 127T880-480q0 83-31.5 156T763-197q-54 54-127 85.5T480-80Zm0-80q53 0 100-15.5t86-44.5q-39-29-86-44.5T480-280q-53 0-100 15.5T294-220q39 29 86 44.5T480-160Zm0-360q26 0 43-17t17-43q0-26-17-43t-43-17q-26 0-43 17t-17 43q0 26 17 43t43 17Zm0-60Zm0 360Z" />
      </svg>
    ),
    pathname: "/dashboard/user",
    metaData: {
      title: "ویرایش اطلاعات",
      description: "در این صفحه می‌توانید نام، نام خانوادگی، شماره تلفن و عکس پروفایل خود را ویرایش کنید.",
    },
  },
  {
    icon: (
      <svg xmlns="http://www.w3.org/2000/svg" height="24px" viewBox="0 -960 960 960" width="24px" fill="currentcolor">
        <path d="M440-440H240q-17 0-28.5-11.5T200-480q0-17 11.5-28.5T240-520h200v-200q0-17 11.5-28.5T480-760q17 0 28.5 11.5T520-720v200h200q17 0 28.5 11.5T760-480q0 17-11.5 28.5T720-440H520v200q0 17-11.5 28.5T480-200q-17 0-28.5-11.5T440-240v-200Z" />
      </svg>
    ),
    pathname: navHeader[4].path,
    metaData: {
      title: "ثبت آگهی",
      description: "به راحتی آگهی جدید خود را ثبت کنید و آن را در معرض دید دیگران قرار دهید.",
    },
  },
  {
    icon: (
      <svg xmlns="http://www.w3.org/2000/svg" height="24px" viewBox="0 -960 960 960" width="24px" fill="currentcolor">
        <path d="M480-147q-14 0-28.5-5T426-168l-69-63q-106-97-191.5-192.5T80-634q0-94 63-157t157-63q53 0 100 22.5t80 61.5q33-39 80-61.5T660-854q94 0 157 63t63 157q0 115-85 211T602-230l-68 62q-11 11-25.5 16t-28.5 5Zm-38-543q-29-41-62-62.5T300-774q-60 0-100 40t-40 100q0 52 37 110.5T285.5-410q51.5 55 106 103t88.5 79q34-31 88.5-79t106-103Q726-465 763-523.5T800-634q0-60-40-100t-100-40q-47 0-80 21.5T518-690q-7 10-17 15t-21 5q-11 0-21-5t-17-15Zm38 189Z" />
      </svg>
    ),
    pathname: "/dashboard/user/wishlist",
    metaData: {
      title: "آگهی‌های ذخیره شده",
      description: "آگهی‌هایی که دوست داشتید را اینجا ذخیره کنید تا هر زمان خواستید دوباره به آن‌ها سر بزنید.",
    },
  },
  {
    icon: (
      <svg xmlns="http://www.w3.org/2000/svg" height="24px" viewBox="0 -960 960 960" width="24px" fill="currentcolor">
        <path d="M840-440h-80q-17 0-28.5-11.5T720-480q0-17 11.5-28.5T760-520h80q17 0 28.5 11.5T880-480q0 17-11.5 28.5T840-440ZM664-288q10-14 26-16t30 8l64 48q14 10 16 26t-8 30q-10 14-26 16t-30-8l-64-48q-14-10-16-26t8-30Zm120-424-64 48q-14 10-30 8t-26-16q-10-14-8-30t16-26l64-48q14-10 30-8t26 16q10 14 8 30t-16 26ZM200-360h-40q-33 0-56.5-23.5T80-440v-80q0-33 23.5-56.5T160-600h160l139-84q20-12 40.5 0t20.5 35v338q0 23-20.5 35t-40.5 0l-139-84h-40v120q0 17-11.5 28.5T240-200q-17 0-28.5-11.5T200-240v-120Zm240-22v-196l-98 58H160v80h182l98 58Zm120 36v-268q27 24 43.5 58.5T620-480q0 41-16.5 75.5T560-346ZM300-480Z" />
      </svg>
    ),
    pathname: "/dashboard/user/my-ads",
    metaData: {
      title: "آگهی‌های من",
      description: "در این بخش می‌توانید آگهی‌های ثبت شده خود را مشاهده، مدیریت و ویرایش کنید.",
    },
  },
  {
    icon: (
      <svg xmlns="http://www.w3.org/2000/svg" height="24px" viewBox="0 -960 960 960" width="24px" fill="currentcolor">
        <path d="M360-304 205-148q-12 12-28 12t-28-12q-12-12-12-28.5t12-28.5l155-155h-64q-17 0-28.5-11.5T200-400q0-17 11.5-28.5T240-440h160q17 0 28.5 11.5T440-400v160q0 17-11.5 28.5T400-200q-17 0-28.5-11.5T360-240v-64Zm296-296h64q17 0 28.5 11.5T760-560q0 17-11.5 28.5T720-520H560q-17 0-28.5-11.5T520-560v-160q0-17 11.5-28.5T560-760q17 0 28.5 11.5T600-720v64l155-156q12-12 28-12t28 12q12 12 12 28.5T811-755L656-600Z" />
      </svg>
    ),
    pathname: "/dashboard/user/compare",
    metaData: {
      title: "مقایسه املاک",
      description: "املاک مورد علاقه خود را به‌صورت دقیق مقایسه کنید و تصمیم بهتری برای خرید یا اجاره بگیرید. امکانات، قیمت و موقعیت جغرافیایی هر آگهی را مشاهده و مدیریت کنید.",
    },
  },
];

export const path_admin = [
  {
    icon: (
      <svg xmlns="http://www.w3.org/2000/svg" height="24px" viewBox="0 -960 960 960" width="24px" fill="currentcolor">
        <path d="M234-276q51-39 114-61.5T480-360q69 0 132 22.5T726-276q35-41 54.5-93T800-480q0-133-93.5-226.5T480-800q-133 0-226.5 93.5T160-480q0 59 19.5 111t54.5 93Zm246-164q-59 0-99.5-40.5T340-580q0-59 40.5-99.5T480-720q59 0 99.5 40.5T620-580q0 59-40.5 99.5T480-440Zm0 360q-83 0-156-31.5T197-197q-54-54-85.5-127T80-480q0-83 31.5-156T197-763q54-54 127-85.5T480-880q83 0 156 31.5T763-763q54 54 85.5 127T880-480q0 83-31.5 156T763-197q-54 54-127 85.5T480-80Zm0-80q53 0 100-15.5t86-44.5q-39-29-86-44.5T480-280q-53 0-100 15.5T294-220q39 29 86 44.5T480-160Zm0-360q26 0 43-17t17-43q0-26-17-43t-43-17q-26 0-43 17t-17 43q0 26 17 43t43 17Zm0-60Zm0 360Z" />
      </svg>
    ),
    pathname: "/dashboard/admin",
    metaData: {
      title: path_user[0].metaData.title,
      description: path_user[0].metaData.description,
    },
  },
  {
    icon: (
      <svg xmlns="http://www.w3.org/2000/svg" height="24px" viewBox="0 -960 960 960" width="24px" fill="currentcolor">
        <path d="M411-480q-28 0-46-21t-13-49l12-72q8-43 40.5-70.5T480-720q44 0 76.5 27.5T597-622l12 72q5 28-13 49t-46 21H411Zm24-80h91l-8-49q-2-14-13-22.5t-25-8.5q-14 0-24.5 8.5T443-609l-8 49ZM124-441q-23 1-39.5-9T63-481q-2-9-1-18t5-17q0 1-1-4-2-2-10-24-2-12 3-23t13-19l2-2q2-19 15.5-32t33.5-13q3 0 19 4l3-1q5-5 13-7.5t17-2.5q11 0 19.5 3.5T208-626q1 0 1.5.5t1.5.5q14 1 24.5 8.5T251-596q2 7 1.5 13.5T250-570q0 1 1 4 7 7 11 15.5t4 17.5q0 4-6 21-1 2 0 4l2 16q0 21-17.5 36T202-441h-78Zm676 1q-33 0-56.5-23.5T720-520q0-12 3.5-22.5T733-563l-28-25q-10-8-3.5-20t18.5-12h80q33 0 56.5 23.5T880-540v20q0 33-23.5 56.5T800-440ZM0-280v-23q0-44 44.5-70.5T160-400q13 0 25 .5t23 2.5q-14 20-21 43t-7 49v65H40q-17 0-28.5-11.5T0-280Zm240 0v-25q0-65 66.5-105T480-450q108 0 174 40t66 105v25q0 17-11.5 28.5T680-240H280q-17 0-28.5-11.5T240-280Zm560-120q72 0 116 26.5t44 70.5v23q0 17-11.5 28.5T920-240H780v-65q0-26-6.5-49T754-397q11-2 22.5-2.5t23.5-.5Zm-320 30q-57 0-102 15t-53 35h311q-9-20-53.5-35T480-370Zm0 50Zm1-280Z" />
      </svg>
    ),
    pathname: "/dashboard/admin/users-list",
    metaData: {
      title: "لیست کاربران",
      description: "در این صفحه می‌توانید فهرست تمام کاربران را مشاهده کنید و اطلاعات مربوط به هر کاربر را مدیریت نمایید.",
    },
  },
  {
    icon: (
      <svg xmlns="http://www.w3.org/2000/svg" height="24px" viewBox="0 -960 960 960" width="24px" fill="currentcolor">
        <path d="M680-80q-83 0-141.5-58.5T480-280q0-83 58.5-141.5T680-480q83 0 141.5 58.5T880-280q0 83-58.5 141.5T680-80Zm20-208v-92q0-8-6-14t-14-6q-8 0-14 6t-6 14v91q0 8 3 15.5t9 13.5l61 61q6 6 14 6t14-6q6-6 6-14t-6-14l-61-61ZM200-120q-33 0-56.5-23.5T120-200v-560q0-33 23.5-56.5T200-840h167q11-35 43-57.5t70-22.5q40 0 71.5 22.5T594-840h166q33 0 56.5 23.5T840-760v160q0 17-11.5 28.5T800-560q-17 0-28.5-11.5T760-600v-160h-80v80q0 17-11.5 28.5T640-640H320q-17 0-28.5-11.5T280-680v-80h-80v560h180q17 0 28.5 11.5T420-160q0 17-11.5 28.5T380-120H200Zm280-640q17 0 28.5-11.5T520-800q0-17-11.5-28.5T480-840q-17 0-28.5 11.5T440-800q0 17 11.5 28.5T480-760Z" />
      </svg>
    ),
    pathname: "/dashboard/admin/pending-ads",
    metaData: {
      title: "آگهی‌های در انتظار",
      description: "در این صفحه می‌توانید اطلاعات مربوط به هر اگهی‌ را مدیریت نمایید و وضعیت اگهی‌های در انتظار را بررسی و پیگیری کنید.",
    },
  },
  {
    icon: (
      <svg xmlns="http://www.w3.org/2000/svg" height="24px" viewBox="0 -960 960 960" width="24px" fill="currentcolor">
        <path d="M798-120q-125 0-247-54.5T329-329Q229-429 174.5-551T120-798q0-18 12-30t30-12h162q14 0 25 9.5t13 22.5l26 140q2 16-1 27t-11 19l-97 98q20 37 47.5 71.5T387-386q31 31 65 57.5t72 48.5l94-94q9-9 23.5-13.5T670-390l138 28q14 4 23 14.5t9 23.5v162q0 18-12 30t-30 12ZM241-600l66-66-17-94h-89q5 41 14 81t26 79Zm358 358q39 17 79.5 27t81.5 13v-88l-94-19-67 67ZM241-600Zm358 358Z" />
      </svg>
    ),
    pathname: "/dashboard/admin/messages",
    metaData: {
      title: "پیام‌ها",
      description: "پیام‌های کاربران را مشاهده، پاسخ دهید و مدیریت کنید.",
    },
  },
  {
    icon: (
      <svg xmlns="http://www.w3.org/2000/svg" height="24px" viewBox="0 -960 960 960" width="24px" fill="currentcolor">
        <path d="M440-520v80q0 17 11.5 28.5T480-400q17 0 28.5-11.5T520-440v-80h80q17 0 28.5-11.5T640-560q0-17-11.5-28.5T600-600h-80v-80q0-17-11.5-28.5T480-720q-17 0-28.5 11.5T440-680v80h-80q-17 0-28.5 11.5T320-560q0 17 11.5 28.5T360-520h80ZM240-240l-92 92q-19 19-43.5 8.5T80-177v-623q0-33 23.5-56.5T160-880h640q33 0 56.5 23.5T880-800v480q0 33-23.5 56.5T800-240H240Zm-34-80h594v-480H160v525l46-45Zm-46 0v-480 480Z" />
      </svg>
    ),
    pathname: "/dashboard/admin/add-blog",
    metaData: {
      title: "مقاله جدید",
      description: "مقاله جدید ایجاد کنید و محتوای سایت را به‌روز نگه دارید.",
    },
  },
  {
    icon: (
      <svg xmlns="http://www.w3.org/2000/svg" height="24px" viewBox="0 -960 960 960" width="24px" fill="currentcolor">
        <path d="M360-600v-80h360v80H360Zm0 120v-80h360v80H360Zm120 320H200h280Zm0 80H240q-50 0-85-35t-35-85v-120h120v-560h600v361q-20-2-40.5 1.5T760-505v-295H320v480h240l-80 80H200v40q0 17 11.5 28.5T240-160h240v80Zm80 0v-123l221-220q9-9 20-13t22-4q12 0 23 4.5t20 13.5l37 37q8 9 12.5 20t4.5 22q0 11-4 22.5T903-300L683-80H560Zm300-263-37-37 37 37ZM620-140h38l121-122-18-19-19-18-122 121v38Zm141-141-19-18 37 37-18-19Z" />
      </svg>
    ),
    pathname: "/dashboard/admin/manage-blogs",
    metaData: {
      title: "مدیریت مقالات",
      description: "تمامی مقالات موجود را مشاهده، ویرایش و حذف کنید.",
    },
  },
];
